# MPG Cars

### Introduction:


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the first dataset [cars1](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv) and [cars2](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv).

In [2]:
address1="https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv"
address2="https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv"

   ### Step 3. Assign each to a to a variable called cars1 and cars2

In [3]:
cars1=pd.read_csv(address1)
cars1

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,NaN,NaN,NaN,NaN,NaN
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,NaN,NaN,NaN,NaN,NaN
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,NaN,NaN,NaN,NaN,NaN
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,NaN,NaN,NaN,NaN,NaN
4,17.0,8,302,140,3449,10.5,70,1,ford torino,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
193,24.0,6,200,81,3012,17.6,76,1,ford maverick,NaN,NaN,NaN,NaN,NaN
194,22.5,6,232,90,3085,17.6,76,1,amc hornet,NaN,NaN,NaN,NaN,NaN
195,29.0,4,85,52,2035,22.2,76,1,chevrolet chevette,NaN,NaN,NaN,NaN,NaN
196,24.5,4,98,60,2164,22.1,76,1,chevrolet woody,NaN,NaN,NaN,NaN,NaN
197,29.0,4,90,70,1937,14.2,76,2,vw rabbit,NaN,NaN,NaN,NaN,NaN

In [4]:
cars2=pd.read_csv(address2)
cars2

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,33.0,4,91,53,1795,17.4,76,3,honda civic
1,20.0,6,225,100,3651,17.7,76,1,dodge aspen se
2,18.0,6,250,78,3574,21.0,76,1,ford granada ghia
3,18.5,6,250,110,3645,16.2,76,1,pontiac ventura sj
4,17.5,6,258,95,3193,17.8,76,1,amc pacer d/l
...,...,...,...,...,...,...,...,...,...
195,27.0,4,140,86,2790,15.6,82,1,ford mustang gl
196,44.0,4,97,52,2130,24.6,82,2,vw pickup
197,32.0,4,135,84,2295,11.6,82,1,dodge rampage
198,28.0,4,120,79,2625,18.6,82,1,ford ranger
199,31.0,4,119,82,2720,19.4,82,1,chevy s-10

### Step 4. Oops, it seems our first dataset has some unnamed blank columns, fix cars1

In [5]:
cars1_drop=cars1.drop(["Unnamed: 9","Unnamed: 10","Unnamed: 11","Unnamed: 12","Unnamed: 13"],axis=1)
cars1_drop

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino
...,...,...,...,...,...,...,...,...,...
193,24.0,6,200,81,3012,17.6,76,1,ford maverick
194,22.5,6,232,90,3085,17.6,76,1,amc hornet
195,29.0,4,85,52,2035,22.2,76,1,chevrolet chevette
196,24.5,4,98,60,2164,22.1,76,1,chevrolet woody
197,29.0,4,90,70,1937,14.2,76,2,vw rabbit

### Step 5. What is the number of observations in each dataset?

In [6]:
cars1.shape

(198, 14)

In [7]:
cars2.shape

(200, 9)

### Step 6. Join cars1 and cars2 into a single DataFrame called cars

In [16]:
cars_union=cars1_drop.append(cars2,ignore_index=False)
cars_union

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino
...,...,...,...,...,...,...,...,...,...
195,27.0,4,140,86,2790,15.6,82,1,ford mustang gl
196,44.0,4,97,52,2130,24.6,82,2,vw pickup
197,32.0,4,135,84,2295,11.6,82,1,dodge rampage
198,28.0,4,120,79,2625,18.6,82,1,ford ranger
199,31.0,4,119,82,2720,19.4,82,1,chevy s-10

### Step 7. Oops, there is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [14]:
owners = np.random.randint(15000, high=73001, size=398)
owners

array([32258, 29801, 38149, 28419, 67495, 33096, 71146, 39070, 41278,
       28652, 21150, 36680, 27152, 17712, 30493, 47984, 72988, 71516,
       24041, 34501, 24274, 45998, 25147, 51150, 70100, 71302, 41341,
       35896, 60235, 36344, 26342, 19357, 54857, 29891, 55208, 45923,
       69764, 67584, 35217, 23065, 65376, 37269, 61213, 19988, 31889,
       19127, 29091, 36831, 24995, 20881, 43712, 52793, 58019, 39383,
       42967, 45552, 62756, 40057, 54745, 50333, 54901, 16127, 62743,
       56904, 34539, 21409, 55311, 16068, 15000, 17945, 62744, 45368,
       67748, 48480, 26197, 31069, 52178, 54174, 68811, 28282, 15684,
       67526, 66323, 72257, 65705, 70887, 60020, 50071, 38804, 25367,
       47868, 16310, 19295, 42887, 36148, 21341, 59814, 65819, 16207,
       20641, 22631, 71943, 30955, 36368, 68818, 55227, 58708, 70199,
       55048, 35427, 47979, 69981, 38119, 62882, 28165, 63480, 22617,
       32790, 33992, 62975, 66128, 70988, 22461, 38229, 29792, 50405,
       49574, 28091, 59506, 47220, 54051, 58209, 34659, 71584, 50614,
       22280, 58435, 54914, 20377, 26728, 24492, 40308, 72433, 62659,
       66534, 64269, 28269, 23520, 58856, 62211, 41654, 45119, 25696,
       15958, 18218, 66324, 34894, 64251, 19039, 27145, 66386, 37067,
       38183, 58761, 64704, 41141, 60612, 68345, 52531, 30879, 66322,
       65315, 67143, 71007, 63711, 29766, 62857, 70973, 49915, 55352,
       16741, 24114, 49979, 28097, 56481, 60415, 46556, 40412, 71587,
       16382, 40593, 72766, 48266, 39416, 16305, 49445, 29506, 54913,
       38744, 45878, 16754, 61645, 29621, 31076, 34315, 32412, 60568,
       26419, 67603, 34737, 25667, 60203, 15900, 39730, 58957, 53616,
       37686, 57663, 65343, 58375, 31584, 63027, 48285, 31205, 23304,
       25844, 68339, 54788, 67074, 26435, 60069, 30525, 62761, 39298,
       54614, 38519, 46697, 66941, 54259, 18819, 37548, 20980, 65425,
       39325, 56809, 18911, 60902, 27404, 49643, 58660, 32481, 28792,
       37182, 42447, 18058, 51931, 31530, 33480, 51616, 69078, 56770,
       42353, 24101, 62515, 33955, 50795, 51784, 27356, 54637, 27912,
       61113, 31369, 42506, 66587, 18941, 45572, 46634, 43710, 52616,
       27088, 71818, 24874, 59508, 56354, 50165, 48391, 48308, 33453,
       47397, 17095, 27301, 59745, 48432, 17083, 69564, 44045, 43634,
       27244, 28497, 58659, 42512, 64683, 45848, 40555, 27903, 16473,
       70985, 68103, 37172, 36763, 45297, 61916, 53509, 71921, 47389,
       19541, 37795, 47622, 26619, 28435, 61373, 61124, 15470, 55511,
       15121, 71661, 27958, 15310, 70884, 26785, 27789, 42196, 27879,
       67725, 15774, 58219, 68560, 27590, 62804, 69811, 15563, 26908,
       44286, 55493, 58272, 70594, 21177, 41421, 48610, 45318, 17622,
       70874, 46126, 58732, 17428, 47012, 20777, 22225, 28143, 24944,
       37744, 57174, 69372, 26374, 56724, 62739, 37398, 67105, 59483,
       19590, 51556, 17812, 44449, 54259, 59405, 52566, 67376, 34251,
       24015, 26199, 41962, 72771, 44927, 19322, 71326, 33563, 46116,
       35303, 71664, 29216, 21707, 61690, 50910, 71964, 55240, 59669,
       30009, 72519])

### Step 8. Add the column owners to cars

In [17]:
cars_union["owners"] = pd.Series(np.random.randint(15000, 73000, size=len(cars_union)))
cars_union

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,owners
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,31231
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,71238
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,34979
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,57278
4,17.0,8,302,140,3449,10.5,70,1,ford torino,46292
...,...,...,...,...,...,...,...,...,...,...
195,27.0,4,140,86,2790,15.6,82,1,ford mustang gl,49180
196,44.0,4,97,52,2130,24.6,82,2,vw pickup,56514
197,32.0,4,135,84,2295,11.6,82,1,dodge rampage,56854
198,28.0,4,120,79,2625,18.6,82,1,ford ranger,23850
199,31.0,4,119,82,2720,19.4,82,1,chevy s-10,25969